{
  "citylist": [
  {
  	"p" : "河南",
  	"c": [
    {
  		"n": "安阳",
  		"a": [{
  			"s": [{
  				"name": "精忠路雅迪",
  				"address": "精忠路雅迪专卖店",
  				"tel": "15821054444"
  			}]
  		},{
  			"s": [{
  				"name": "内黄县枣乡雅迪",
  				"address": "内黄县枣乡大道",
  				"tel": "15821052222"
  			}]
  		}]
  	},
    {
      "n": "焦作",
      "a": [{
        "s": [{
          "name": "克井雅迪",
          "address": "阿里山的房间开",
          "tel": "15821054444"
        }]
      },{
        "s": [{
          "name": "案多发发达地方",
          "address": "打发打发",
          "tel": "15821052222"
        }]
      }]
    }]
  },
  {
		"p" : "山东",
  	"c": [{
  		"n": "焦作",
  		"a": [{
  			"s": [{
  				"name": "UC",
  				"address": "热个事",
  				"tel": "15821054444"
  			}]
  		},{
  			"s": [{
  				"name": "阿打算发三",
  				"address": "框架好离开",
  				"tel": "15821052222"
  			}]
  		}]
  	}]
  }]
}